Enums/НазначенияПоказателейРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>НазначенияПоказателейРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПодразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПоказателейРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыПоказателейРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Денежный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Числовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧисловойЗависящийОтДругогоПоказателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧисловойЗависящийОтСтажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыПримененияЗначенийПоказателейРасчетаЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разовое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПоказателиРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПоказателиРасчетаЗарплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеРассчитываетсяАвтоматически</Name>
					<Comment>Признак определяет возможность ввода значения пользователем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПримененияЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаЗначенийПоказателейРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВДокументахНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиРасчетаЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопускаетсяНулевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодическийПоказательСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодическийПоказательОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодическийПоказательПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйПоказательСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйПоказательОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазовыйПоказательПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйПоказательСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйПоказательОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйПоказательПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаОценкиСтажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерхняяГраницаИнтервалаСтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпособыОкругленияПриРасчетеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СпособыОкругленияПриРасчетеЗарплаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравилаОкругленияПриРасчетеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИндексацияЗаработка/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьИндексируемыеПоУмолчаниюПоказатели(ИндексируемыеПоказатели, ПоказателиПредыдущейИндексации) Экспорт
	
	ПоказателиДляЗагрузки = Неопределено;
	
	Если ЕстьПоказателиПредыдущейИндексации(ПоказателиПредыдущейИндексации) Тогда
		ПоказателиДляЗагрузки = ПоказателиПредыдущейИндексации;
	Иначе
		ПоказателиДляЗагрузки = ПоказателиПоУмолчанию();
	КонецЕсли;
	
	УстановитьИндексируемыеПоказатели(ИндексируемыеПоказатели, ПоказателиДляЗагрузки); 
	
	УстановитьОкруглениеПоУмолчанию(ИндексируемыеПоказатели);
	
КонецПроцедуры

Процедура УстановитьОкруглениеПоУмолчанию(ИндексируемыеПоказатели) Экспорт
	
	Показатели = Новый Массив;
	Для каждого ИндексируемыйПоказатель Из ИндексируемыеПоказатели Цикл
		Показатели.Добавить(ИндексируемыйПоказатель.Показатель); 
	КонецЦикла;		
	
	ОкруглениеПоУмолчаниюДляПоказателей = Справочники.ПоказателиРасчетаЗарплаты.ОкруглениеПоУмолчаниюДляПоказателей(Показатели);	
	Для каждого ИндексируемыйПоказатель Из ИндексируемыеПоказатели Цикл
		ИндексируемыйПоказатель.СпособОкругления = ОкруглениеПоУмолчаниюДляПоказателей[ИндексируемыйПоказатель.Показатель]; 
	КонецЦикла;		
	
КонецПроцедуры

Функция ОписаниеОкругленияПоказателей(СпособыОкругленияПоказателей) Экспорт
	
	ОписаниеОкругленияПоказателей = Новый Соответствие;
	
	ОписаниеСпособовОкругления = Справочники.СпособыОкругленияПриРасчетеЗарплаты.ОписаниеСпособовОкругления(СпособыОкругленияПоказателей.ВыгрузитьКолонку("СпособОкругления"));
	
	Для каждого Показатель Из СпособыОкругленияПоказателей Цикл
		
		ТочностьПоказателя = ЗарплатаКадрыРасширенныйПовтИсп.СведенияОПоказателеРасчетаЗарплаты(Показатель.Показатель).Точность;
		
		ОписаниеОкругленияПоказателя = Новый Структура("ТочностьОкругления,ПравилоОкругления");
		ОписаниеОкругленияПоказателя.Вставить("ПравилоОкругления", Неопределено);
		ОписаниеОкругленияПоказателя.Вставить("ТочностьОкругления", Pow(0.1, ТочностьПоказателя));
		
		Если ЗначениеЗаполнено(Показатель.СпособОкругления)  Тогда
			ОписаниеСпособаОкругления = ОписаниеСпособовОкругления.Получить(Показатель.СпособОкругления);
			Если ОписаниеСпособаОкругления <> Неопределено Тогда
				ОписаниеОкругленияПоказателя.Вставить("ТочностьОкругления", Макс(ОписаниеОкругленияПоказателя.ТочностьОкругления, ОписаниеСпособаОкругления.Точность));
				ОписаниеОкругленияПоказателя.Вставить("ПравилоОкругления", ОписаниеСпособаОкругления.ПравилоОкругления);
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеОкругленияПоказателей.Вставить(Показатель.Показатель, ОписаниеОкругленияПоказателя);
		
	КонецЦикла;
	
	Возврат ОписаниеОкругленияПоказателей;
	
КонецФункции

Функция ИндексированноеЗначениеПоказателя(Значение, Коэффициент, ОписаниеОкругления) Экспорт
	ИндексированноеЗначениеПоказателя = Значение * Коэффициент;
	Возврат ЗарплатаКадрыКлиентСервер.Округлить(ИндексированноеЗначениеПоказателя, ОписаниеОкругления.ТочностьОкругления, ОписаниеОкругления.ПравилоОкругления);
КонецФункции

Функция ИндексируемыеПоУмолчаниюПоказатели() Экспорт
	
	Показатели = ПоказателиПоУмолчанию();
	Возврат Показатели.Выгрузить().ВыгрузитьКолонку("Показатель");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПоказателиПредыдущейИндексации(ПоказателиПредыдущейИндексации) 
	
	Возврат Не ПоказателиПредыдущейИндексации.Пустой();
	
КонецФункции

Процедура УстановитьИндексируемыеПоказатели(ИндексируемыеПоказатели, ПоказателиДляЗагрузки) 
	
	ИндексируемыеПоказатели.Загрузить(ПоказателиДляЗагрузки.Выгрузить())	
	
КонецПроцедуры

Функция ПоказателиПоУмолчанию()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоказателиРасчетаЗарплаты.Ссылка КАК Показатель
	|ИЗ
	|	Справочник.ПоказателиРасчетаЗарплаты КАК ПоказателиРасчетаЗарплаты
	|ГДЕ
	|	ПоказателиРасчетаЗарплаты.Идентификатор В(&ИдентификаторыПоказателейПоУмолчанию)
	|	И ПоказателиРасчетаЗарплаты.НазначениеПоказателя = ЗНАЧЕНИЕ(Перечисление.НазначенияПоказателейРасчетаЗарплаты.ДляСотрудника)
	|	И ПоказателиРасчетаЗарплаты.ТипПоказателя = ЗНАЧЕНИЕ(Перечисление.ТипыПоказателейРасчетаЗарплаты.Денежный)
	|	И ПоказателиРасчетаЗарплаты.СпособПримененияЗначений = ЗНАЧЕНИЕ(Перечисление.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное)";
	
	Запрос.УстановитьПараметр("ИдентификаторыПоказателейПоУмолчанию", ИдентификаторыПоказателейПоУмолчанию()); 
	
	Возврат Запрос.Выполнить();
		
КонецФункции

Функция ИдентификаторыПоказателейПоУмолчанию()
	
	ИдентификаторыПоказателейПоУмолчанию = Новый Массив;
	ИдентификаторыПоказателейПоУмолчанию.Добавить("Оклад");
	ИдентификаторыПоказателейПоУмолчанию.Добавить("ОкладПоДолжности");
	ИдентификаторыПоказателейПоУмолчанию.Добавить("ТарифнаяСтавкаДневная");
	ИдентификаторыПоказателейПоУмолчанию.Добавить("ТарифнаяСтавкаЧасовая");
	
	Возврат ИдентификаторыПоказателейПоУмолчанию;
	
КонецФункции
	
#КонецОбласти
